## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

<details>
  <summary><h2>Terrateam Plan Output :heavy_multiplication_x:</h2></summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: cost-estimation
**Success**: :thumbsup:
```
'terraformWorkspace'
```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>

**Dir**: digger_infra
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.container-myapp1236-107a83f2.data.aws_vpc.vpc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "vpc" {
+       arn                                  = (known after apply)
+       cidr_block                           = (known after apply)
+       cidr_block_associations              = (known after apply)
+       default                              = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = (known after apply)
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = (known after apply)
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       state                                = (known after apply)
+       tags                                 = (known after apply)

+       timeouts {
+           read = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.aws_ecs_cluster.app will be created
+   resource "aws_ecs_cluster" "app" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "myapp1236-107a83f2"
+       tags               = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all           = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }

+       default_capacity_provider_strategy {
+           base              = (known after apply)
+           capacity_provider = (known after apply)
+           weight            = (known after apply)
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # module.container-myapp1236-107a83f2.aws_security_group.ecs_service_sg will be created
+   resource "aws_security_group" "ecs_service_sg" {
+       arn                    = (known after apply)
+       description            = "Security group shared by all ECS services"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "myapp1236-107a83f2"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_alb.main will be created
+   resource "aws_alb" "main" {
+       arn                        = (known after apply)
+       arn_suffix                 = (known after apply)
+       desync_mitigation_mode     = "defensive"
+       dns_name                   = (known after apply)
+       drop_invalid_header_fields = false
+       enable_deletion_protection = false
+       enable_http2               = true
+       enable_waf_fail_open       = false
+       id                         = (known after apply)
+       idle_timeout               = 60
+       internal                   = false
+       ip_address_type            = (known after apply)
+       load_balancer_type         = "application"
+       name                       = "myapp1236-107a83f2"
+       preserve_host_header       = false
+       security_groups            = (known after apply)
+       subnets                    = (known after apply)
+       tags                       = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all                   = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)

+       access_logs {
+           bucket  = (known after apply)
+           enabled = true
        }

+       subnet_mapping {
+           allocation_id        = (known after apply)
+           ipv6_address         = (known after apply)
+           outpost_id           = (known after apply)
+           private_ipv4_address = (known after apply)
+           subnet_id            = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_alb_listener.http will be created
+   resource "aws_alb_listener" "http" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_alb_target_group.main will be created
+   resource "aws_alb_target_group" "main" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "30"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       name                               = "myapp1236-107a83f2"
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all                           = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 5
+           interval            = 30
+           matcher             = "200-499"
+           path                = "/"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 10
+           unhealthy_threshold = 5
        }

+       stickiness {
+           cookie_duration = (known after apply)
+           cookie_name     = (known after apply)
+           enabled         = (known after apply)
+           type            = (known after apply)
        }

+       target_failover {
+           on_deregistration = (known after apply)
+           on_unhealthy      = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_appautoscaling_policy.app_down will be created
+   resource "aws_appautoscaling_policy" "app_down" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "app-scale-down"
+       policy_type        = "StepScaling"
+       resource_id        = "service/myapp1236-107a83f2/myapp1236-107a83f2"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ChangeInCapacity"
+           cooldown                = 300
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = -1
            }
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_appautoscaling_policy.app_up will be created
+   resource "aws_appautoscaling_policy" "app_up" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "app-scale-up"
+       policy_type        = "StepScaling"
+       resource_id        = "service/myapp1236-107a83f2/myapp1236-107a83f2"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ChangeInCapacity"
+           cooldown                = 60
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               scaling_adjustment          = 1
            }
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_appautoscaling_target.app_scale_target will be created
+   resource "aws_appautoscaling_target" "app_scale_target" {
+       id                 = (known after apply)
+       max_capacity       = 8
+       min_capacity       = 1
+       resource_id        = "service/myapp1236-107a83f2/myapp1236-107a83f2"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_cloudwatch_log_group.logs will be created
+   resource "aws_cloudwatch_log_group" "logs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/ecs/service/myapp1236-107a83f2"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all          = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_cloudwatch_metric_alarm.cpu_utilization_high will be created
+   resource "aws_cloudwatch_metric_alarm" "cpu_utilization_high" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_name                            = "myapp1236-107a83f2-myapp1236-107a83f2-CPU-Utilization-High-80"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = {
+           "ClusterName" = "myapp1236-107a83f2"
+           "ServiceName" = "myapp1236-107a83f2"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "CPUUtilization"
+       namespace                             = "AWS/ECS"
+       period                                = 60
+       statistic                             = "Average"
+       tags_all                              = (known after apply)
+       threshold                             = 80
+       treat_missing_data                    = "missing"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_cloudwatch_metric_alarm.cpu_utilization_low will be created
+   resource "aws_cloudwatch_metric_alarm" "cpu_utilization_low" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_name                            = "myapp1236-107a83f2-myapp1236-107a83f2-CPU-Utilization-Low-20"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = {
+           "ClusterName" = "myapp1236-107a83f2"
+           "ServiceName" = "myapp1236-107a83f2"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "CPUUtilization"
+       namespace                             = "AWS/ECS"
+       period                                = 60
+       statistic                             = "Average"
+       tags_all                              = (known after apply)
+       threshold                             = 20
+       treat_missing_data                    = "missing"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_ecr_repository.app will be created
+   resource "aws_ecr_repository" "app" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "myapp1236-107a83f2"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       health_check_grace_period_seconds  = 1
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "myapp1236-107a83f2"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "myapp1236-107a83f2"
+           container_port   = 80
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_ecs_task_definition.app will be created
+   resource "aws_ecs_task_definition" "app" {
+       arn                      = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "myapp1236-107a83f2"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all                 = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       task_role_arn            = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_iam_role.ecsTaskExecutionRole will be created
+   resource "aws_iam_role" "ecsTaskExecutionRole" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myapp1236-107a83f2-myapp1236-107a83f2-ecs"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_iam_role.ecs_task_role will be created
+   resource "aws_iam_role" "ecs_task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myapp1236-107a83f2_task_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_iam_role_policy.ecs_task_role_policy will be created
+   resource "aws_iam_role_policy" "ecs_task_role_policy" {
+       id     = (known after apply)
+       name   = "myapp1236-107a83f2_task_role_policy"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ecr:GetAuthorizationToken",
+                           "ecr:BatchCheckLayerAvailability",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:BatchGetImage",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "myapp1236-107a83f2-myapp1236-107a83f2-ecs"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_iam_role_policy_attachment.ecsTaskExecutionRole_ssm_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_ssm_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
+       role       = "myapp1236-107a83f2-myapp1236-107a83f2-ecs"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_s3_bucket.lb_access_logs will be created
+   resource "aws_s3_bucket" "lb_access_logs" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = "myapp1236-107a83f2"
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all                    = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_s3_bucket_acl.lb_access_logs_acl will be created
+   resource "aws_s3_bucket_acl" "lb_access_logs_acl" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_s3_bucket_lifecycle_configuration.lb_access_logs_lifecycle_rule will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "lb_access_logs_lifecycle_rule" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           id     = "cleanup"
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 1
            }

+           expiration {
+               days                         = 3
+               expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_s3_bucket_policy.lb_access_logs will be created
+   resource "aws_s3_bucket_policy" "lb_access_logs" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_s3_bucket_server_side_encryption_configuration.lb_access_logs_server_side_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "lb_access_logs_server_side_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group.ecs_task_sg will be created
+   resource "aws_security_group" "ecs_task_sg" {
+       arn                    = (known after apply)
+       description            = "Limit connections from internal resources while allowing myapp1236-107a83f2-task to connect to all external resources"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "myapp1236-107a83f2-myapp1236-107a83f2-task"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all               = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       vpc_id                 = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group.lb_sg will be created
+   resource "aws_security_group" "lb_sg" {
+       arn                    = (known after apply)
+       description            = "Allow connections from external resources while limiting connections from myapp1236-107a83f2-lb to internal resources"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "myapp1236-107a83f2-myapp1236-107a83f2-lb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       tags_all               = {
+           "digger_identifier" = "myapp1236-107a83f2"
        }
+       vpc_id                 = (known after apply)
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group_rule.ecs_task_egress_rule will be created
+   resource "aws_security_group_rule" "ecs_task_egress_rule" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allows task to establish connections to all resources"
+       from_port                = 0
+       id                       = (known after apply)
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group_rule.ecs_task_ingress_rule will be created
+   resource "aws_security_group_rule" "ecs_task_ingress_rule" {
+       description              = "Only allow connections from SG myapp1236-107a83f2-lb on port 80"
+       from_port                = 80
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 80
+       type                     = "ingress"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group_rule.ingress_lb_http will be created
+   resource "aws_security_group_rule" "ingress_lb_http" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "HTTP"
+       from_port                = 80
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 80
+       type                     = "ingress"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group_rule.ingress_lb_https will be created
+   resource "aws_security_group_rule" "ingress_lb_https" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "HTTPS"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.container-myapp1236-107a83f2.module.service.aws_security_group_rule.lb_egress_rule will be created
+   resource "aws_security_group_rule" "lb_egress_rule" {
+       description              = "Only allow SG myapp1236-107a83f2-lb to connect to myapp1236-107a83f2-task on port 80"
+       from_port                = 80
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 80
+       type                     = "egress"
    }

  # module.network.module.vpc.aws_egress_only_internet_gateway.this[0] will be created
+   resource "aws_egress_only_internet_gateway" "this" {
+       id       = (known after apply)
+       tags     = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
        }
+       tags_all = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
        }
+       vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
        }
+       tags_all = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
        }
+       vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_route.private_ipv6_egress[0] will be created
+   resource "aws_route" "private_ipv6_egress" {
+       destination_ipv6_cidr_block = "::/0"
+       egress_only_gateway_id      = (known after apply)
+       id                          = (known after apply)
+       instance_id                 = (known after apply)
+       instance_owner_id           = (known after apply)
+       network_interface_id        = (known after apply)
+       origin                      = (known after apply)
+       route_table_id              = (known after apply)
+       state                       = (known after apply)
    }

  # module.network.module.vpc.aws_route.private_ipv6_egress[1] will be created
+   resource "aws_route" "private_ipv6_egress" {
+       destination_ipv6_cidr_block = "::/0"
+       egress_only_gateway_id      = (known after apply)
+       id                          = (known after apply)
+       instance_id                 = (known after apply)
+       instance_owner_id           = (known after apply)
+       network_interface_id        = (known after apply)
+       origin                      = (known after apply)
+       route_table_id              = (known after apply)
+       state                       = (known after apply)
    }

  # module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.network.module.vpc.aws_route.public_internet_gateway_ipv6[0] will be created
+   resource "aws_route" "public_internet_gateway_ipv6" {
+       destination_ipv6_cidr_block = "::/0"
+       gateway_id                  = (known after apply)
+       id                          = (known after apply)
+       instance_id                 = (known after apply)
+       instance_owner_id           = (known after apply)
+       network_interface_id        = (known after apply)
+       origin                      = (known after apply)
+       route_table_id              = (known after apply)
+       state                       = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private"
        }
+       tags_all         = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public"
        }
+       tags_all         = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private-us-east-2a"
        }
+       tags_all                                       = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private-us-east-2a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private-us-east-2b"
        }
+       tags_all                                       = {
+           "Name" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-private-us-east-2b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public-us-east-2a"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
+       tags_all                                       = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public-us-east-2a"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public-us-east-2b"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
+       tags_all                                       = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc-public-us-east-2b"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       assign_generated_ipv6_cidr_block     = true
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
+       tags_all                             = {
+           "Name"              = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network-vpc"
+           "digger_identifier" = "env-267d033f-69e1-4f00-b622-aab3868e77f7-network"
        }
    }

Plan: 48 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
